## Comprehensive Guide on Pandas Datetime

##### In this post we will explore the Pandas datetime methods which can be used instantaneously to work with datetime in Pandas.

##### I am sharing the table of content in case you are just interested to see a specific topic then this would help you to jump directly over there

In [ ]:
Table of Content:
    1. Datetime Index using date_range - frequency
    2. Creat Dataframe using Datetime Index
    3. Import CSV file in a dataframe using parse_date
    4. Convert date column to datetime object
    5. Extract data using datetime accessor
    6. Timeseries Aggreggation using resample
    7. Indexing and Slicing of datetime Index
    8. Date Offsets: Adding a day, adding hours etc.
    9. Advanced Datetime Index functions
    10. Understanding CustomBusinessDays
    11. Timezones
    12. Business Hours and CustomBusinessHours
    13. Difference Between two dates column

## Import time-series data

###### This is the monthly electrical consumption data in csv which we will import in a dataframe and data can be downloaded using this link

### parse_dates attributes in read_csv() function

###### We are using parse_date attribute to parse and convert the date columns in the csv files to numpy datetime64 type

In [8]:
import pandas as pd
import numpy as np

df=pd.read_csv('./Electric_Production.csv',parse_dates=['DATE'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 2 columns):
DATE          397 non-null datetime64[ns]
IPG2211A2N    397 non-null float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 6.3 KB

### Pandas to_datetime

###### Alternatively, you can use to_datetime to convert any column to datetime

In [6]:
df['DATE']=pd.to_datetime(df['DATE'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 2 columns):
DATE          397 non-null datetime64[ns]
IPG2211A2N    397 non-null float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 6.3 KB

### Extract Month and Year from datetime using datetime accessor

#### We will create 3 new columns here for Year, Month and day after extracting it from the Date column

In [10]:
df['Year']=df['DATE'].dt.year
df['month']=df['DATE'].dt.month
df['day']=df['DATE'].dt.day
df.head()

        DATE  IPG2211A2N  Year  month  day
0 1985-01-01     72.5052  1985      1    1
1 1985-02-01     70.6720  1985      2    1
2 1985-03-01     62.4502  1985      3    1
3 1985-04-01     57.4714  1985      4    1
4 1985-05-01     55.3151  1985      5    1

In [11]:
# OR

df['Year']=df['DATE'].apply(lambda x: x.year)
df['month']=df['DATE'].apply(lambda x: x.month)
df['day']=df['DATE'].apply(lambda x: x.day)
df.head()

        DATE  IPG2211A2N  Year  month  day
0 1985-01-01     72.5052  1985      1    1
1 1985-02-01     70.6720  1985      2    1
2 1985-03-01     62.4502  1985      3    1
3 1985-04-01     57.4714  1985      4    1
4 1985-05-01     55.3151  1985      5    1

## Time Series- Aggregation
### resample to find sum on the date index date

###### resample() is a method in pandas that can be used to summarize data by date or time. 

###### Let's find the Yearly sum of Electricity Consumption

In [60]:
df.set_index('DATE').resample('1Y').sum().head()

            IPG2211A2N   Year  month  day
DATE
1985-12-31    745.9880  23820     78   12
1986-12-31    752.5187  23832     78   12
1987-12-31    788.8833  23844     78   12
1988-12-31    836.5963  23856     78   12
1989-12-31    862.7420  23868     78   12

### resample to find mean on the date index date

##### Lets find the Electricity consumption mean for each year

In [59]:
df.set_index('DATE').resample('1Y').mean().head()

            IPG2211A2N    Year  month  day
DATE
1985-12-31   62.165667  1985.0    6.5  1.0
1986-12-31   62.709892  1986.0    6.5  1.0
1987-12-31   65.740275  1987.0    6.5  1.0
1988-12-31   69.716358  1988.0    6.5  1.0
1989-12-31   71.895167  1989.0    6.5  1.0

## Datetime index and slice

#### Just ensure that the datetime column is set as index for the dataframe. I am using set_index() function to set that before index and slice

#### Filter using the date

In [13]:
df.set_index('DATE')['1987'].head(2)

            IPG2211A2N  Year  month  day
DATE
1987-01-01     73.8152  1987      1    1
1987-02-01     70.0620  1987      2    1

#### Filter all rows between two dates i.e. 1989-JAN and 1995-Apr here

In [17]:
df.set_index('DATE')['1989-01':'1995-04'].head()

            IPG2211A2N  Year  month  day
DATE
1989-01-01     77.9188  1989      1    1
1989-02-01     76.6822  1989      2    1
1989-03-01     73.3523  1989      3    1
1989-04-01     65.1081  1989      4    1
1989-05-01     63.6892  1989      5    1

### Date Offset

####  Its a kind of date increment used for a date range. As per the documentation:

#### DateOffset work as follows. Each offset specify a set of dates that conform to the DateOffset. For example, Bday defines this #### set to be the set of dates that are weekdays (M-F). To test if a date is in the set of a DateOffset dateOffset we can use the #### onOffset method: dateOffset.onOffset(date).

#### If a date is not on a valid date, the rollback and rollforward methods can be used to roll the date to the nearest valid date #### before/after the date.

#### DateOffsets can be created to move dates forward a given number of valid dates. For example, Bday(2) can be added to a #### date to move it two business days forward. If the date does not start on a valid date, first it is moved to a valid date

#### Add one day

#### Here we are adding a day(timedelta of 1 day) to the Date column in dataframe and creating a new column called as next_day

In [18]:
df['next_day']=df['DATE']+pd.Timedelta('1 day')
df.head()

        DATE  IPG2211A2N  Year  month  day   next_day
0 1985-01-01     72.5052  1985      1    1 1985-01-02
1 1985-02-01     70.6720  1985      2    1 1985-02-02
2 1985-03-01     62.4502  1985      3    1 1985-03-02
3 1985-04-01     57.4714  1985      4    1 1985-04-02
4 1985-05-01     55.3151  1985      5    1 1985-05-02

### Adding a Business day

#### Here we are adding a Business day using Bday param, it will add a day between Mon-Fri. if a date is Sat then add a bday will return the next Monday i.e. a Business day instead of a Saturday

In [67]:
df['next_day']=df['DATE'].apply(lambda x: x+pd.offsets.BDay(1))
df.head()

        DATE  IPG2211A2N  Year  month  day   next_day
0 1985-01-01     72.5052  1985      1    1 1985-01-02
1 1985-02-01     70.6720  1985      2    1 1985-02-04
2 1985-03-01     62.4502  1985      3    1 1985-03-04
3 1985-04-01     57.4714  1985      4    1 1985-04-02
4 1985-05-01     55.3151  1985      5    1 1985-05-02

### Add 2 business days

#### Addind two days to the current DATE column using days parameter and create a new column day_after

In [19]:
df['day_after']=df['DATE'].apply(lambda x: x+pd.DateOffset(days=2))
df.head()

        DATE  IPG2211A2N  Year  month  day   next_day  day_after
0 1985-01-01     72.5052  1985      1    1 1985-01-02 1985-01-03
1 1985-02-01     70.6720  1985      2    1 1985-02-02 1985-02-03
2 1985-03-01     62.4502  1985      3    1 1985-03-02 1985-03-03
3 1985-04-01     57.4714  1985      4    1 1985-04-02 1985-04-03
4 1985-05-01     55.3151  1985      5    1 1985-05-02 1985-05-03

### Add next month date

#### Adding a month to the DATE column using months parameter

In [70]:
df['next_month_day']=df['DATE'].apply(lambda x: x+pd.DateOffset(months=1))
df.head()

,DATE,IPG2211A2N,Year,month,day,next_day,day_after,next_month_day
0,1985-01-01,72.5052,1985,1,1,1985-01-02,1985-01-03,1985-02-01
1,1985-02-01,70.6720,1985,2,1,1985-02-04,1985-02-03,1985-03-01
2,1985-03-01,62.4502,1985,3,1,1985-03-04,1985-03-03,1985-04-01
3,1985-04-01,57.4714,1985,4,1,1985-04-02,1985-04-03,1985-05-01
4,1985-05-01,55.3151,1985,5,1,1985-05-02,1985-05-03,1985-06-01

#### For the complete list of parameters check this link
#### https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.tseries.offsets.DateOffset.html

## Using date_range to create datetime index

#### it is Immutable numpy ndarray of datetime64 data, We will see how to create datetime index and eventually create a dataframe using these datetime index arrays

### Datetime index with Hourly frequency

#### It gives the array of date and time starting from '2018-01-01' with a Hourly frequency and period=3 means total elements of 3

In [27]:
import pandas as pd
dti = pd.date_range('2018-01-01', periods=3, freq='H')
dti

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')

### Monthly Frequency

#### Now change the frequency to Monthly and create total 10 date array

In [22]:
index = pd.date_range('2018-01-01',periods=10, freq='M')
index

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30', '2018-07-31', '2018-08-31',
               '2018-09-30', '2018-10-31'],
              dtype='datetime64[ns]', freq='M')

### Weekly Frequency with start and end

#### Change the frequency to Weekly and create dates between two dates using start and end dates

In [25]:
pd.date_range(start='2019-01-01', end='2019-04-30', freq='W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03', '2019-02-10', '2019-02-17', '2019-02-24',
               '2019-03-03', '2019-03-10', '2019-03-17', '2019-03-24',
               '2019-03-31', '2019-04-07', '2019-04-14', '2019-04-21',
               '2019-04-28'],
              dtype='datetime64[ns]', freq='W-SUN')

### Datetime index with start and end

In [31]:
import datetime
start = datetime.datetime(2011, 1, 1)

end = datetime.datetime(2011, 2, 1)

index = pd.date_range(start, end)
index

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14', '2011-01-15', '2011-01-16',
               '2011-01-17', '2011-01-18', '2011-01-19', '2011-01-20',
               '2011-01-21', '2011-01-22', '2011-01-23', '2011-01-24',
               '2011-01-25', '2011-01-26', '2011-01-27', '2011-01-28',
               '2011-01-29', '2011-01-30', '2011-01-31', '2011-02-01'],
              dtype='datetime64[ns]', freq='D')

### Create dataframe using date time index

#### Create dataframe with datetime as index

#### Here index: dti is the date_range created above with hourly frequency

In [29]:
import numpy as np
df= pd.DataFrame({'price':np.random.uniform(0,20,size=3)},index=dti)
df

                         price
2018-01-01 00:00:00   1.005757
2018-01-01 01:00:00  15.762388
2018-01-01 02:00:00   3.260808

#### Create datafrema with datetime as a column

In [30]:
import numpy as np
df= pd.DataFrame({'price':np.random.uniform(0,20,size=3),'date':dti})
df

       price                date
0  17.763795 2018-01-01 00:00:00
1   4.811412 2018-01-01 01:00:00
2  13.950828 2018-01-01 02:00:00

### Datetime Index Using Holiday Calendar

#### You can also use the Holiday calendars to provide the list of holidays. Here we are using freq as US holiday calendar, So the
#### final datetime index will skip all the dates available in that holiday calendar

In [32]:
from pandas.tseries.holiday import USFederalHolidayCalendar
from pandas.tseries.offsets import CustomBusinessDay

us_bd = CustomBusinessDay(calendar=USFederalHolidayCalendar())
print (pd.date_range(start='2019-12-24',end='2019-12-31', freq=us_bd))

DatetimeIndex(['2019-12-24', '2019-12-26', '2019-12-27', '2019-12-30',
               '2019-12-31'],
              dtype='datetime64[ns]', freq='C')

### Datetime Index using Origin Parameter

#### You can set the origin date and a list of days as a parameter and add that to origin date. Here the origin is 2019-10-25 
#### and adding 1 day to it gives 2019-10-26 and similarly adding 2 and 3 gives 2019-10-27 and 2019-10-28 resp

In [36]:
pd.to_datetime([1, 2, 3], unit='D', origin=pd.Timestamp('2019-10-25'))

DatetimeIndex(['2019-10-26', '2019-10-27', '2019-10-28'], dtype='datetime64[ns]', freq=None)

### Week masking and Holidays

#### One of the important feature is Week masking, In Middle eastern countries the working days in a week is thru Sun-Thu and 
#### Fri,Sat is considered as Weekends. So here we are creating a dateindex using such working weeks from Sun-Thu and
#### list of Holidays

In [79]:
weekmask = 'Sun Mon Tue Wed Thu'

holidays = [datetime.datetime(2011, 1, 5), datetime.datetime(2011, 3, 14)]

pd.bdate_range(start, end, freq='C', weekmask=weekmask, holidays=holidays)

DatetimeIndex(['2011-01-02', '2011-01-03', '2011-01-04', '2011-01-06',
               '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-16', '2011-01-17', '2011-01-18',
               '2011-01-19', '2011-01-20', '2011-01-23', '2011-01-24',
               '2011-01-25', '2011-01-26', '2011-01-27', '2011-01-30',
               '2011-01-31', '2011-02-01'],
              dtype='datetime64[ns]', freq='C')

### Understand Custom Business days

#### Using CustomBusinessdays you can create the custom business day using the same example of Middle eastern countries
#### as shown above. This will work exactly the same way as Dateoffset Bday() explained above. 

#### As shown in the example here, if we add 2 business days after 2013-04-30(Tue) considering 2013-05-01(Wed) is a holiday as it in holiday #### list, If we add 2 Middle eastern business day to 2013-04-30 then it will return 2013-05-05 since Wed(2013-05-01) is a Holiday
#### and Fri and Sat is a weekend so the 2nd business day is Sunday i.e. 2013-05-05

In [40]:
import datetime
import numpy as np
import pandas as pd

weekmask_egypt = 'Sun Mon Tue Wed Thu'

holidays = ['2012-05-01',datetime.datetime(2013, 5, 1),np.datetime64('2014-05-01')]

bday_egypt = pd.offsets.CustomBusinessDay(holidays=holidays,weekmask=weekmask_egypt)

# dt = datetime.datetime(2013, 4, 30)
dt = pd.Timestamp('2013-04-30 17:00')
dt+2*bday_egypt

Timestamp('2013-05-05 17:00:00')

### Using Truncate

#### Two date attributes after and before is used to filter the records

In [81]:
df.truncate(after='2019-10')

,DATE,IPG2211A2N,Year,month,day,next_day,day_after,next_month_day
0,1985-01-01,72.5052,1985,1,1,1985-01-02,1985-01-03,1985-02-01
1,1985-02-01,70.6720,1985,2,1,1985-02-04,1985-02-03,1985-03-01
2,1985-03-01,62.4502,1985,3,1,1985-03-04,1985-03-03,1985-04-01
3,1985-04-01,57.4714,1985,4,1,1985-04-02,1985-04-03,1985-05-01
4,1985-05-01,55.3151,1985,5,1,1985-05-02,1985-05-03,1985-06-01
...,...,...,...,...,...,...,...,...
197,2001-06-01,90.3955,2001,6,1,2001-06-04,2001-06-03,2001-07-01
198,2001-07-01,96.0740,2001,7,1,2001-07-02,2001-07-03,2001-08-01
199,2001-08-01,99.5534,2001,8,1,2001-08-02,2001-08-03,2001-09-01
200,2001-09-01,88.2810,2001,9,1,2001-09-03,2001-09-03,2001-10-01
201,2001-10-01,82.6860,2001,10,1,2001-10-02,2001-10-03,2001-11-01

## Timezones

#### Using parameter tz you can set the timezone for the timestamp, You can check the list of pytz timezones

In [41]:
ts = pd.Timestamp('2016-10-30 00:00:00', tz='Asia/Kolkata')
ts

Timestamp('2016-10-30 00:00:00+0530', tz='Asia/Kolkata')

### convert the timezone of timestamp

#### Convert the timestamp to another timezone using tz_convert

In [43]:

pd.Timestamp('2016-10-30 00:00:00', tz='Asia/Kolkata').tz_convert('Europe/Amsterdam')

Timestamp('2016-10-29 20:30:00+0200', tz='Europe/Amsterdam')

### dt accessor

#### datetime accessor can be used for datetime object to access any of those date features like hours, days, dayofweek, isleapyear etc.

In [86]:
s_naive = pd.Series(pd.date_range('2016-10-30 14:25:57', periods=3))
s_naive.dt.hour

0    14
1    14
2    14
dtype: int64

In [87]:
s_naive = pd.Series(pd.date_range('2016-10-30 14:25:57', periods=3))
s_naive.dt.tz_localize('UTC').dt.tz_convert('Europe/Amsterdam')

0   2016-10-30 15:25:57+01:00
1   2016-10-31 15:25:57+01:00
2   2016-11-01 15:25:57+01:00
dtype: datetime64[ns, Europe/Amsterdam]

### Business Hour

#### default business hour is from 9:00 AM to 5:00PM for 7 hours. Adding 2 business hours returns 11:00AM and adding 8 business hours returns the next day

In [69]:
bh = pd.offsets.BusinessHour()
pd.Timestamp('2016-10-30 00:00:00', tz='Asia/Kolkata')+2*bh

Timestamp('2016-10-31 11:00:00+0530', tz='Asia/Kolkata')

### setting business hour

#### You can also set your own business hours with a start and end time

In [70]:
bh = pd.offsets.BusinessHour(start='11:00', end=datetime.time(20, 0))

### Custom Business Hour

#### You can also set a CustomBusinessHours incorporating the Holiday Calendar list with a start and end business hours and
#### weekmask as explained above

In [71]:
# Makr this Italic
CustomBusinessHour(n=1, normalize=False, weekmask='Mon Tue Wed Thu Fri', holidays=None, calendar=None, start='09:00', end='17:00', offset=datetime.timedelta(0))

NameError: name 'CustomBusinessHour' is not defined

In [73]:
import datetime
from pandas.tseries.holiday import USFederalHolidayCalendar
dt = datetime.datetime(2014, 1, 17, 15)

bhour_us = pd.offsets.CustomBusinessHour(calendar=USFederalHolidayCalendar(),start='11:00', end=datetime.time(20, 0),
                                        weekmask='Mon Tue Wed Thu Fri')
dt+bhour_us

Timestamp('2014-01-17 16:00:00')

### Difference between two date columns

#### Lets see how to find difference between two datetime columns in dataframe in terms of no of days, seconds etc

In [75]:
import pandas as pd
from datetime import datetime
import numpy as np

# create dataframe
df = pd.DataFrame(data=[['A', '2019-10-06T12:25:53', '2019-10-04T10:10:53'],
                        ['A', '2019-10-04T10:10:53', '2019-10-01T08:10:53'],
                        ['B', '2019-10-01T08:10:53', '2019-09-23T01:24:53'],
                        ['B', '2019-09-23T01:24:53', '2019-09-23T15:58:17']],
                  columns=['Letter', 'First_Day', 'Last_Day'])

df['First_Day']=pd.to_datetime(df['First_Day'])
df['Last_Day']=pd.to_datetime(df['Last_Day'])
df

  Letter           First_Day            Last_Day
0      A 2019-10-06 12:25:53 2019-10-04 10:10:53
1      A 2019-10-04 10:10:53 2019-10-01 08:10:53
2      B 2019-10-01 08:10:53 2019-09-23 01:24:53
3      B 2019-09-23 01:24:53 2019-09-23 15:58:17

### Difference between two dates in days and seconds

In [76]:
df['diff']=(pd.to_datetime(df['First_Day']) - pd.to_datetime(df['Last_Day'])).dt.days
df['diff_time_delta']=df['First_Day']-df['Last_Day']
df['diff-simple_subtract']=((df['First_Day']-df['Last_Day']).dt.total_seconds())//3600

In [77]:
df.head()

,Letter,First_Day,Last_Day,diff,diff_time_delta,diff-simple_subtract
0,A,2019-10-06 12:25:53,2019-10-04 10:10:53,2,2 days 02:15:00,50.0
1,A,2019-10-04 10:10:53,2019-10-01 08:10:53,3,3 days 02:00:00,74.0
2,B,2019-10-01 08:10:53,2019-09-23 01:24:53,8,8 days 06:46:00,198.0
3,B,2019-09-23 01:24:53,2019-09-23 15:58:17,-1,-1 days +09:26:36,-15.0